import codecs
import random
import string

last_names = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋',
              '沈', '韩', '杨', '朱', '秦', '尤', '许', '何', '吕', '施', '张', '孔', '曹',
              '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '窦',
              '章', '云', '苏', '潘', '葛', '奚', '范', '彭', '郎', '鲁', '韦', '昌', '马',
              '苗', '凤', '花', '方', '俞', '任', '袁', '柳', '酆', '鲍', '史', '唐', '费',
              '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '邬',
              '安', '常', '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余', '元',
              '卜', '顾', '孟', '平', '黄', '和', '穆', '萧', '尹', '姚', '邵', '堪', '汪',
              '祁', '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈',
              '宋', '茅', '庞', '熊', '纪', '舒', '屈', '项', '祝', '董', '梁']

first_names=['梦琪','忆','柳','之','绿冰','蓝','灵','槐','平','安','书','翠','翠','风',
              '香','巧','代','云','梦','曼','幼','翠','友','巧','听','寒','梦','柏','醉','易',
              '旋','亦','玉','凌','萱','访','语卉','怀','亦','笑','蓝','春','翠','靖','柏','夜',
              '蕾','冰','夏','语梦','松','书','雪','乐','枫','念','薇','靖','雁','寻','春','恨',
              '山','从','寒','忆','香','觅','波','静','曼','凡','旋','以','亦','念','露','芷',
              '蕾','千','兰','新','波','代','真','新','春蕾','雁','玉','冷','卉','紫','山','千',
              '琴','恨','天','傲','芙','盼','山','怀','蝶','冰','兰','山','柏','翠','语萱','恨',
              '松','问','旋','从','南','白','易','问','筠','如霜','半','芹','丹','珍','冰彤',
              '亦姗','寒','雁','怜','云','寻','文','乐晴','丹雅','翠','柔','谷玲','山','之',
              '瑶','冰','露','尔','珍','谷','雪','乐','萱','涵','菡','海','莲','傲','蕾','青',
              '槐','冬','儿','易','梦','惜','雪','宛','海','之','柔','夏','青','亦','瑶','妙',
              '菡','春','竹','痴','梦','紫','蓝','晓','巧','幻','柏','元','风','冰','枫','访',
              '蕊','南','春','芷偌','春蕊','凡','蕾','凡','柔','安','蕾','天','荷','含','玉','书',
              '兰','雅','琴竹','青书','瑶','春','雁','从','安','夏','槐','念','芹','怀','萍','代',
              '曼','幻','珊','谷','丝','秋','翠','白','晴','海','露','代','荷','含','玉','书',
              '蕾','听','白','访','琴','灵','雁','秋','春','晓雪','青','晓乐','瑶','含','烟','涵',
              '双','平','蝶','小雅','晓蕊','傲','之','灵','薇','绿','春','含','蕾','从','梦','从',
              '蓉','初','丹','听','兰','听','蓉','语','芙','夏','彤','凌','瑶','忆','翠','幻',
              '灵','怜','菡','紫','南','依','晓珊','妙瑞','竹','访','烟','怜','蕾','映','寒','友',
              '绿','冰','萍','惜','霜','凌','景香','芷','蕾','雁','卉','迎','梦','元','柏','代',
              '萱','紫','真','千','青','凌','寒','紫','安','寒','安','怀','蕊','秋','语荷','语涵',
              '雁','以','山','凡','梅','盼','晓曼','翠','彤','谷','冬','新','巧','冷','安','千',
              '萍','冰','青烟','青雅','阳','友','绿萍','南','松灵','诗','云','飞','风','寄','灵','书',
              '芹','幼','蓉','以','蓝','笑','寒','忆','寒','秋','烟','芷','巧','水','香','映',
              '之','醉','波','幻','莲','夜','山','芷','卉','向','彤','小','玉','幼','南','凡',
              '梦','尔','曼灵','念','波','迎','松','青','寒','笑','天','涵','蕾','碧','菡','映',
              '秋','盼','语烟','忆','山','以','寒','寒','香','小','凡','代','亦','梦','露','映',
              '波','友','蕊','寄','凡','怜','蕾','雁','枫','水','绿','曼','荷','笑','珊','寒',
              '珊','谷','灵南','慕','儿','夏','晓岚','友','灵儿','小','萱','紫','青','妙','菱','冬',
              '寒','曼','柔','语','蝶','青','筠','夜','安','觅','海','问','安','晓','槐','雅',
              '山','访','云','翠','容','寒','凡','晓','绿','以','菱','冬','云','含','玉','访',
              '枫','含','卉','夜','白','冷','安','灵','竹','醉','薇','元','珊','幻','波','盼',
              '夏','元','瑶','迎','曼','水','云','访','琴','谷','波','乐','之','笑','白','之',
              '山','妙','海','紫','霜','平','夏','凌','旋','孤','丝','怜','寒','向','萍','凡',
              '松','青','丝','翠','安','如','天','凌','雪','绮','菱','代','云','南','莲','寻',
              '南','春','文','香','薇','冬','灵','青凌','珍','采','绿','天','春','沛','文','紫',
              '槐','幻','柏','采','文','春','梅','雪','旋','盼','海','映','梦','安','秋雁','映',
              '容','秋凝','阳','访','风','天','亦','平','绿','香','风','霜','雪','柳','雪','靖',
              '白','梦','飞','绿','如','波','又','晴','友','香','菱','冬','亦','问','妙','春',
              '海','冬','半','安','平','春','幼','柏','秋','灵','语凝','芙','念','烟','白','山',
              '从','灵','尔','芙']

# 随机生成姓
def getSurname():
    surname = random.choice(last_names)
    return surname

def getfirstName():
    firstName = random.choice(first_names)
    return firstName

# 随机生成手机号
def getTelNo():
    phone_list = []
    phone_head = random.choice([150, 189, 188, 187, 132, 186, 130, 159, 152, 135, 182, 155])
    phone_end = random.randint(0, 99999999)
    phone = '%s%08d' % (phone_head, phone_end)
    if phone not in phone_list:
        phone_list.append(phone)
    return phone

# 随机生成登录名
def getLoginId():
    code = ''
    for i in range(8):
        add = random.choice([random.randrange(10),chr(random.randrange(65,91))])
        code += str(add)
    return code

def getEmail():
    number = ''.join((str(random.randint(3,9)) for i in range(9)))
    return number + '@' + 'qq.com'


# 随机生成n条用户信息写入到本地文件
def main(filename):
    user_list = []
    with codecs.open(filename,'w','utf-8') as f:
        infocount = int(input("请输入您要随机生成的注册信息数量："))
        for i in range(infocount):
            user_dict = {}
            surname = getSurname()
            user_dict['surname'] = surname
            firstName = getfirstName()
            user_dict['firstName'] = firstName
            phoneNum = getTelNo()
            user_dict['contactPhoneNo'] = phoneNum
            email = getEmail()
            user_dict['emailAddress'] = email
            loginId = getLoginId()
            user_dict['loginId'] = loginId
            user_list.append(user_dict)
            f.write(str(user_dict)+'\n')
        # print(user_list)
    print(user_list)
    return user_list


if __name__ == '__main__':
    filename = 'infomation.txt'
    main(filename)